interface var06 {

  public double logika(double d1, double d2, double d3);
  // ƒаны три числа. ¬ыдать пор€дковый номер меньшего из них. 

  public void poka(int N);
  // ƒано целое число N (> 0). »спользу€ операции делени€ нацело и вз€ти€ 
  // остатка от делени€, найти число, полученное при прочтении 
  // числа N справа налево.

  public void massivy(double[] A);
  // Ќайти номер первого локального минимума массива A (локальный 
  // минимум - это элемент, который меньше своего левого и правого соседей). 

}
