interface var05 {

  public double logika(double d1, double d2, double d3);
  // Даны три числа. Метод возвращает ноль, если наименьшее из 
  // них - отрицательное число, и один - в остальных случаях

  public void poka(int N);
  // Дано целое число N (> 0). Используя операции деления нацело и
  // взятия остатка от деления, найти количество и сумму его цифр.

  public void massivy(double[] A);
  // Найти количество участков в массиве A, на которых его элементы 
  // монотонно возрастают (каждый последующий больше предыдущего).

}
