interface var09 {

  public double logika(double d1, double d2, double d3);
  // Даны три числа. Вычесть самое большое число из произведения двух остальных чисел

  public void poka(int N);
  // Дано целое число N (> 0). Если оно является простым, то есть не
  // имеет положительных делителей, кроме 1 и самого себя, то вывести TRUE,
  // иначе вывести FALSE

  public void massivy(double[] A);
  //  Проверить, чередуются ли в массиве A положительные и отрицательные числа. 
  // Если чередуются, то вывести 0, если нет, то вывести максимальное из 
  // чисел массива 

}
