interface var08 {

  public double logika(double d1, double d2, double d3);
  // Даны три числа, одно из которых отлично от двух других, равных между 
  // собой. Определить порядковый номер числа, отличного от остальных.

  public void poka(int N);
  // Дано целое число N (> 0). С помощью операций деления нацело и взятия 
  // остатка от деления определить, имеются ли в записи числа N
  // нечетные цифры. Если имеются, то вывести TRUE, если нет - вывести
  // FALSE.

  public void massivy(double[] A);
  // Найти минимальный элемент массива A из его элементов с четными индексами

}
